app/controllers/topics_controller.rb

  def index
    @topics = Topic.page params[:page]
---
SELECT "topics".* FROM "topics"

  def show
    @topic = Topic.find(params[:id])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @topic = Topic.find(params[:id])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @topic = Topic.new(params[:topic])

    respond_to do |format|
      if @topic.save
---
INSERT INTO "topics" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 18 Mar 2013 20:28:57 UTC +00:00], ["description", "Des_01"], ["title", "Title_01"], ["updated_at", Mon, 18 Mar 2013 20:28:57 UTC +00:00]]

  def update
    @topic = Topic.find(params[:id])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]